Repository: SAP/sapmachine-manager-for-macos
Catalog: source/SapMachine Manager/*.lproj/Localizable.strings
Languages: de

# installOneButtonTitle
source: Install update
de: Update installieren

# installMultipleButtonTitle
source: Install available updates
de: Updates installieren

# checkButtonTitle
source: Check for updates
de: Nach Updates suchen

# noUpdatesAvailable
source: SapMachine is up-to-date on your Mac.
de: SapMachine ist auf Ihrem Mac auf dem aktuellen Stand.

# oneUpdateAvailable
source: There is an update available.
de: Es ist ein Update verfügbar.

# multipleUpdatesAvailable
source: There are %ld updates available.
de: Es sind %ld Updates verfügbar.

# statusUpdateAvailable
source: The installed version %@ can be updated to version %@.
de: Die installierte Version %@ kann auf die Version %@ aktualisiert werden.

# statusUpToDate
source: The installed version %@ is the current version.
de: Die installierte Version %@ ist aktuell.

# statusToolTipUpdateAvailable
source: Update available
de: Update verfügbar

# statusToolTipUpToDate
source: Current version installed
de: Aktuelle Version installiert

# dialogNoAssetsTitle
source: Would you like to install SapMachine?
de: Möchten Sie SapMachine installieren?

# dialogNoAssetsMessage
source: SapMachine is not installed on your Mac. If you want to install SapMachine, please click the appropriate button below.
de: SapMachine ist momentan nicht auf Ihrem Mac installiert. Wenn Sie SapMachine installieren möchten, klicken Sie bitte auf die entsprechende untenstehende Taste.

# dialogNoAssetsCheckbox
source: Install recommended version of SapMachine
de: Empfohlene Version von SapMachine installieren

# dialogNoAssetsNoAvailableTitle
source: SapMachine is not installed!
de: SapMachine ist nicht installiert!

# dialogNoAssetsNoAvailableMessage
source: SapMachine is not installed on your Mac. Please install any SapMachine release and run this application again.
de: SapMachine ist momentan nicht auf Ihrem Mac installiert. Bitte installieren Sie eine beliebige SapMachine-Version und starten Sie dann dieses Programm erneut.

# dialogOneUpdateFailedTitle
source: An update could not be applied!
de: Ein Update konnte nicht durchgeführt werden!

# dialogOneUpdateFailedMessage
source: An error occurred while installing a SapMachine update. Please check the log for details.
de: Bei der Installation eines SapMachine Updates ist ein Fehler aufgetreten. Einzelheiten entnehmen Sie bitte dem Protokoll.

# dialogMultipleUpdatesFailedTitle
source: Some updates could not be applied!
de: Einige Updates konnten nicht durchgeführt werden!

# dialogMultipleUpdatesFailedMessage
source: Some errors occurred while installing SapMachine updates. Please check the log for details.
de: Bei der Installation mehrerer SapMachine Updates sind Fehler aufgetreten. Einzelheiten entnehmen Sie bitte dem Protokoll..

# dialogFailedToSaveLogTitle
source: The log could not be saved!
de: Das Protokoll konnte nicht gespeichert werden!

# dialogFailedToSaveLogMessage
source: An error occurred while writing the log to file. Please check if the location you selected is writable and try again.
de: Beim Schreiben der Protokolldatei ist ein Fehler aufgetreten. Bitte überprüfen Sie, ob der ausgewählte Speicherort korrekt ist und versuchen Sie es erneut.

# dialogXPCConnectionFailedTitle
source: Failed to connect to daemon!
de: Verbindung zum Daemon fehlgeschlagen!

# dialogXPCConnectionFailedMessage
source: For this application to work correctly, it must connect to a daemon. Unfortunately, this connection has failed, so the application must now quit.
de: Damit dieses Programm korrekt funktionieren kann, muss es sich mit einem Daemon verbinden. Leider ist diese Verbindung fehlgeschlagen, sodass das Programm jetzt beendet werden muss.

# dialogXPCConnectionFailedLoginItemMessage
source: For this application to work correctly, it must connect to a daemon. Therefore this application's login item needs to be enabled in System Settings which is currently not the case. Please enable the login item and try again.
de: Damit dieses Programm korrekt funktionieren kann, muss es sich mit einem Daemon verbinden. Dafür muss das Anmeldeobjekt dieses Programms in den Systemeinstellungen aktiviert sein, was derzeit nicht der Fall ist. Bitte aktivieren Sie das Anmeldeobjekt und versuchen Sie es erneut.

# dialogLoginItemDisabledTitle
source: Login item not enabled!
de: Anmeldeobjekt ist nicht aktiviert!

# dialogLoginItemDisabledMessage
source: This application's login item needs to be enabled in System Settings for this application to work correctly. Please enable the login item and try again.
de: Das Anmeldeobjekt dieses Programms muss in den Systemeinstellungen aktiviert werden, damit das Programm korrekt funktionieren kann. Bitte aktivieren Sie das Anmeldeobjekt und versuchen Sie es erneut.

# packageBuildReleaseSelect
source: Please select the release and type of SapMachine you want to package:
de: Bitte wählen Sie die Version und den Typ der SapMachine, die Sie paketieren möchten:

# installReleaseSelect
source: Please select the release and type of SapMachine you want to install:
de: Bitte wählen Sie die Version und den Typ der SapMachine, die Sie installieren möchten:

# packageBuildPrepare
source: Preparing package…
de: Paket wird vorbereitet …

# packageBuildNoScript2Pkg
source: Your package has been prepared but could not be passed to Script2Pkg for package creation. Please check if Script2Pkg is installed in your Mac's Applications folder and try again. As the source folder of the package is displayed in the Finder, you can use it to create the package manually after installing Script2Pkg.
de: Ihr Paket wurde vorbereitet, konnte jedoch nicht an Script2Pkg zur Paketerstellung übergeben werden. Bitte überprüfen Sie, ob Script2Pkg im Programme-Ordner Ihres Macs installiert ist und versuchen Sie es erneut. Der Quellordner des Pakets wird im Finder angezeigt und kann nach der Installation von Script2Pkg verwendet werden, um das Paket manuell zu erstellen.

# packageBuildFinish
source: Successfully prepared package "%@".
de: Das Paket "%@" wurde erfolgreich vorbereitet.

source: Pre-Release
de: Vorabversion

# dialogDeleteOneTitle
source: Are you sure you want to delete "%@" from your Mac?
de: Sind Sie sicher, dass Sie "%@" von Ihrem Mac löschen wollen?

# dialogDeleteMultipleTitle
source: Are you sure you want to delete the %ld selected SapMachines from your Mac?
de: Sind Sie sicher, dass Sie die %ld ausgewählten SapMachine-Versionen von Ihrem Mac löschen wollen?

# dialogDeleteMessage
source: You can't undo this action.
de: Diese Aktion kann nicht rückgänging gemacht werden.

# dialogDeletionOneFailedTitle
source: SapMachine could not be deleted!
de: SapMachine konnte nicht gelöscht werden!

# dialogDeletionOneFailedMessage
source: An error occurred while deleting the SapMachine from your Mac. Please check the log for details.
de: Beim Versuch, SapMachine von Ihrem Mac zu löschen, ist ein Fehler aufgetreten. Einzelheiten entnehmen Sie bitte dem Protokoll.

# dialogDeletionMultipleFailedTitle
source: Some of the selected SapMachines could not be deleted!
de: Einige der ausgewählten SapMachine-Versionen konnten nicht gelöscht werden!

# dialogDeletionMultipleFailedMessage
source: An error occurred while deleting the selected SapMachines from your Mac. Please check the log for details.
de: Beim Versuch, die ausgewählten SapMachine-Versionen von Ihrem Mac zu löschen, ist ein Fehler aufgetreten. Einzelheiten entnehmen Sie bitte dem Protokoll.

# dialogNothingToInstallTitle
source: No further SapMachine releases available!
de: Keine weiteren SapMachine-Versionen verfügbar!

# dialogNothingToInstallMessage
source: There are currently no further SapMachine releases available to install on your Mac.
de: Derzeit sind keine weiteren SapMachine-Versionen für die Installation auf Ihrem Mac verfügbar.

# dialogNothingToPackageTitle
source: No SapMachine releases available!
de: Keine SapMachine-Versionen verfügbar!

# dialogNothingToPackageMessage
source: There are currently no SapMachine releases available. Please try again later.
de: Derzeit sind keine SapMachine-Versionen verfügbar. Bitte versuchen Sie es später noch einmal.

# deleteOneMenuEntry
source: Delete this SapMachine
de: Diese SapMachine löschen

# deleteSelectedMenuEntry
source: Delete selected SapMachines (%ld items)
de: Ausgewählte SapMachine-Versionen löschen (%ld Objekte)

# deleteOneMainMenuEntry
source: Delete Selected SapMachine
de: Ausgewählte SapMachine löschen

# deleteMultipleMainMenuEntry
source: Delete Selected SapMachines (%ld Items)
de: Ausgewählte SapMachine-Versionen löschen (%ld Objekte)

# quitButton
source: Quit
de: Beenden

# showLogButton
source: Show Log…
de: Protokoll anzeigen …

# tryAgainButton
source: Try Again
de: Erneut versuchen

# openSettingsButton
source: Open System Settings
de: Systemeinstellungen öffnen

# installButton
source: Install
de: Installieren

# cancelButton
source: Cancel
de: Abbrechen

# deleteButton
source: Delete
de: Löschen

# errorAssetInUse
source: Could not update SapMachine because it was in use
de: SapMachine konnte nicht aktualisiert werden, weil sie in Benutzung war

# errorUnpackingUnexpected
source: Unpacked downloaded file with unexpected results
de: Das Entpacken der heruntergeladenen Datei lieferte ein unerwartetes Ergebnis

# errorUnpackingFailed
source: Failed to unpack downloaded file
de: Die heruntergeladene Datei konnte nicht entpackt werden

# errorChecksum
source: The checksum of the downloaded file could not be successfully verified
de: Die Prüfsumme der heruntergeladenen Datei konnte nicht erfolgreich überprüft werden

# errorUnknown
source: An unknown error occurred
de: Ein unbekannter Fehler ist aufgetreten

# errorUserNotAuthorizedInstall
source: The current user is not authorized to install SapMachine
de: Der aktuelle Benutzer ist nicht berechtigt, SapMachine zu installieren

# errorOperationInProgress
source: Another operation is already in progress
de: Ein anderer Vorgang ist bereits in Gange

# errorNoAssets
source: No assets provided
de: Es wurden keine Objekte angegeben

# errorNoInstallURL
source: No install url provided
de: Es wurde kein Installationspfad angegeben

# errorUserNotAuthorizedDelete
source: The current user is not authorized to delete SapMachine releases
de: Der aktuelle Benutzer ist nicht berechtigt, SapMachine zu löschen
